#!/usr/bin/perl

#* IP-адрес 1
#* метка времени 2
#* строка запроса 3
#* статус-код выполнения запроса 4
#* кол-во отданных по сети байт сжатых данных 5
#* refferer (URI, с которого был осуществлен вызов запроса) 6
#* user agent (метка браузера или робота, выполнившего запрос) 7
#* коэффициент сжатия данных перед передачей по сети 8

use 5.018;
use strict;
use warnings;
use DDP;
my $str = '93.76.7.30 [03/Mar/2017:18:46:00 +0300] "GET /music/songs/nto-trauma-worakls-remix-0c5fcf324311cf433c31ce0f9104694a/related HTTP/1.1" 200 84033 "-" "Mozilla/5.0 (compatible; YandexBot/3.0; +http://yandex.com/bots)" "7.70"';
$str =~ m/^(\d{1,3}.\d{1,3}.\d{1,3}.\d{1,3})\s{1}+\[(\d{2}\/\w+\/\d{4}:\d{2}:\d{2}:\d{2} \+0300)\] "(.+?)" (\d{3}) (\d+) "(.+?)" "(.+?)" "(\d{1}.\d{2}||-)"$/;
say $1;
say $2;
say $3;
say $4;
say $5;
say $6;
say $7;
say $8;
#[(.*)]\s*"(.+)"\d+\s*\d+\s"(.*)"\s*"(.*)"\s*"(\d{1}.\d{2})"
$str = "[03/Mar/2017:18:46:00 +0300]";
#say $str =~ m/\[\d{2}\/\w+\/\d{4}:\d{2}:\d{2}:\d{2} \+0300\]/;

