#!/usr/bin/perl

#* IP-адрес 1
#* метка времени 2
#* строка запроса 3
#* статус-код выполнения запроса 4
#* кол-во отданных по сети байт сжатых данных 5
#* refferer (URI, с которого был осуществлен вызов запроса) 6
#* user agent (метка браузера или робота, выполнившего запрос) 7
#* коэффициент сжатия данных перед передачей по сети 8

use 5.018;
use strict;
use warnings;
use DDP;
my $str = '37.20.165.188 [03/Mar/2017:19:08:18 +0300] "GET /music/artists/%D0%A1%D0%B0%D1%88%D0%B0%20Project HTTP/1.1" 302 829 "http://go.mail.ru/some/page/845160" "Mozilla/5.0 (Windows NT 5.1; rv:51.0) Gecko/20100101 Firefox/51.0" "-"';
$str =~ m/^(\d{1,3}.\d{1,3}.\d{1,3}.\d{1,3})\s*\[(.+)\]\s*"(.+?)"\s*(\d+)\s*(\d+)\s*"(.*?)"\s*"(.*?)"\s*"(\d+.\d+|.*)"/;
#[(.*)]\s*"(.+)"\d+\s*\d+\s"(.*)"\s*"(.*)"\s*"(\d{1}.\d{2})"
say $1;
say $2;
say $3;
say $4;
say $5;
say $6;
say $7;
say $8;
