#!/usr/bin/perl

#* IP-адрес 1
#* метка времени 2
#* строка запроса 3
#* статус-код выполнения запроса 4
#* кол-во отданных по сети байт сжатых данных 5
#* refferer (URI, с которого был осуществлен вызов запроса) 6
#* user agent (метка браузера или робота, выполнившего запрос) 7
#* коэффициент сжатия данных перед передачей по сети 8

use 5.018;
use strict;
use warnings;
use DDP;
my $str = '51.34.179.202 [03/Mar/2017:18:46:00 +0300] "GET /gmail.com/clicksud.com/video/embed/_myvideo/662 HTTP/1.1" 200 17179 "-" "Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTMmyfe4 1488555960:000 87.168.22.22 - - [03/Mar/2017:18:46:00 +0300] "GET /music/search/b.a.p HTTP/1.1" 200 88619 "-" "Mozilla/5.0 (Windows NT 6.3; WOW64; rv:51.0) Gecko/20100101 Firefox/51.0" "8.22"';
$str =~ m{^
			(?<ip>\d{1,3}[.]\d{1,3}[.]\d{1,3}[.]\d{1,3})[ ]
			\[(?<date>\d{2}/\w+/\d{4}:\d{2}:\d{2}:\d{2}[ ]\+0300)\][ ]
			"(.+?)"[ ]
			(?<status>\d{3})[ ]
			(?<data>\d+)[ ]
			"(.+?)"[ ]"(.+?)"[ ]
			"(?<coef>\d{1}[.]\d{2}||-)"
		$}x; #why?
say $+{ip};
say $+{date};
say $+{data};
say $+{coef};
#[(.*)]\s*"(.+)"\d+\s*\d+\s"(.*)"\s*"(.*)"\s*"(\d{1}.\d{2})"
$str = "[03/Mar/2017:18:46:00 +0300]";
#say $str =~ m/\[\d{2}\/\w+\/\d{4}:\d{2}:\d{2}:\d{2} \+0300\]/;

